package books;

public class Test {
    public static void main(String[] args) {
        Book book1 = new Book("Война и мир",
                "978-5-389-06256-6",
                "Толстой Л.Н.",
                "роман",
                2013,
                1500,
                200000,
                10.0,
                1540.60,
                true);
        Book book2 = new Book("Азбука",
                "978-5-389--6",
                "Жукова О.С.",
                "учебник",
                2019,
                50,
                29000,
                9.0,
                540.60,
                true);

        Book book3 = new Book("Книга о вкусной и полезной пище",
                "978-5-39-6",
                "Иванов И.И.",
                "кулинарная книга",
                2020,
                150,
                2000,
                4.0,
                40.60,
                false);

        Book book4 = new Book("Красная шапочка",
                "978-5-00-0-6",
                "Перро Ш.",
                "сказки",
                2009,
                90,
                9000,
                8.0,
                490.70,
                false);

        Book book5 = new Book("Три мушкетёра",
                "9-5-389-0-6",
                "Дюма Аю",
                "приключения",
                2003,
                650,
                35000,
                9.6,
                5000.60,
                true);


        Book[] toStudy = new Book[]{book1, book2};


    }
}
